/*
   Localizable.strings - 简体中文
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "是";
"No" = "否";
"Ok" = "确定";
"Cancel" = "取消";
"Close" = "关闭";
"Save" = "保存";
"Delete" = "删除";
"Rename" = "重命名";
"Extract" = "解压";
"Cut" = "剪切";
"Paste" = "粘贴";
"Create" = "创建";
"Reset" = "重置";

/* Common States */
"Loading" = "载入中";
"Extracting" = "解压中";
"Seeking" = "定位中";
"Seeking %d%%" = "定位中 %d%%";
"Refreshing" = "刷新中";
"Browsing" = "浏览中";
"Cancelling..." = "取消中...";

/* Common Messages */
"Error" = "错误";
"OK" = "确定";
"Warning" = "警告";
"Do you want to reset to default value:\n" = "是否重置为默认值:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "本地浏览";
"Browser_LocalBrowsing_SubKey" = "浏览、播放和删除本地文件。";

"Browser_MODLAND_MainKey" = "MODLAND 收藏";
"Browser_MODLAND_SubKey" = "%d 个可下载文件。";

"Browser_HVSC_MainKey" = "HVSC 收藏";
"Browser_HVSC_SubKey" = "%d 个可下载文件。";

"Browser_Playlists_MainKey" = "播放列表";
"Browser_Playlists_SubKey" = "组织、创建、删除和收听。";

"Browser_Favorites_MainKey" = "收藏夹";
"Browser_Favorites_SubKey" = "收听已评分的歌曲。";

"Browser_Most_played_MainKey" = "最常播放";
"Browser_Most_played_SubKey" = "收听最常播放的歌曲。";

"Browser_Web_MainKey" = "网页";
"Browser_Web_SubKey" = "浏览互联网并下载音乐。";

"Browser_WorldCharts_MainKey" = "世界排行榜";
"Browser_WorldCharts_SubKey" = "排行榜和下载链接。";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "视频游戏音乐提取";

"Browser_UserGuide_MainKey" = "用户指南";
"Browser_UserGuide_SubKey" = "手册、常见问题、提示。";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "获取所有缺失条目";
"GetAllEntries_SubKey" = "限制为前 256 个缺失条目。";

"DisplayAll_MainKey" = "按名称列出全部";
"DisplayAll_SubKey" = "当前目录:";

"DisplayDir_MainKey" = "列表/目录";
"DisplayDir_SubKey" = "全部按路径排序:";

"DisplayAllPath_MainKey" = "按路径列出全部";
"DisplayAllPath_SubKey" = "全部按名称排序:";

/* Browser View Modes */
"Formats/Artists/Files" = "格式/艺术家/文件";
"Artists/Formats/Files" = "艺术家/格式/文件";
"Artists/Files" = "艺术家/文件";
"Formats: %d entries." = "格式: %d 个条目。";
"Artists: %d entries." = "艺术家: %d 个条目。";

/* Browser Stats */
"Played %d times." = "播放了 %d 次。";
"Played once." = "播放了一次。";
"Never played." = "从未播放。";
"%d files." = "%d 个文件。";
"1 file." = "1 个文件。";
"Size: %dKB" = "大小: %dKB";

/* Browser Messages */
"Browser not enough mem." = "条目过多,无法分配内存。";
"Browser not enough mem. Limited." = "条目过多,无法分配内存。列表不完整。";

/* File Operations */
"New folder" = "新建文件夹";
"Enter folder name" = "输入文件夹名称";
"Nothing to paste" = "无可粘贴内容";
"No file to extract or not supported archive format.\n" = "没有可解压的文件或不支持的压缩格式。\n";
"Cannot use iCloud as folder name" = "不能使用 iCloud 作为文件夹名称";

"Issue %d while trying to delete entry.\n%@" = "删除条目时出现问题 %d。\n%@";
"Issue %d while trying to renamefile.\n%@" = "重命名文件时出现问题 %d。\n%@";
"Issue %d while moving: %@.\n%@" = "移动时出现问题 %d: %@。\n%@";
"Issue %d while creating folder\n%@" = "创建文件夹时出现问题 %d\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "文件在本地不可用。\n正在从 iCloud 下载,请在'文件'应用中查看。";

"unavailable" = "不可用";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "播放列表 (%d)";
"Playlist/Search off" = "播放列表/搜索关闭";

"Local (%d, limited to %d)" = "本地 (%d,限制为 %d)";
"Local (%d)" = "本地 (%d)";
"Local/Search off" = "本地/搜索关闭";

"Modland (%d, limited to %d)" = "Modland (%d,限制为 %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/搜索关闭";

"HVSC (%d, limited to %d)" = "HVSC (%d,限制为 %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/搜索关闭";

"ASMA (%d, limited to %d)"="ASMA (%d,限制为 %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/搜索关闭";

/* Search Messages */
"Searching Playlists..." = "搜索播放列表...";
"Searching Local files..." = "搜索本地文件...";
"Searching MODLAND..." = "搜索 MODLAND...";
"Searching HVSC..." = "搜索 HVSC...";

"Please enter at least 2 characters for your search." = "请输入至少 2 个字符进行搜索。";
"Please activate at least 1 section for your search." = "请至少激活 1 个搜索区域。";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "正在播放";
"Now playing(%d)" = "正在播放(%d)";
"Most played" = "最常播放";
"Favorites" = "收藏夹";
"Resuming last\nplayed file" = "恢复上次\n播放的文件";

/* Player Controls */
"Previous" = "上一首";
"Previous file" = "上一个文件";
"Next file" = "下一个文件";
"Next" = "下一首";
"Pause" = "暂停";
"Show Modizer" = "显示 Modizer";
"Shuffle" = "随机播放";
"Voices control" = "声部控制";
"All voices" = "全部声部";
"Clear 'Now Playing' queue" = "清空'正在播放'队列";

/* Song Selection */
"Choose a subsong" = "选择子曲目";
"Choose a song" = "选择歌曲";

/* Player Messages */
"Nothing currently playing. Please select a file." = "当前未播放任何内容。请选择一个文件。";
"File cannot be played. Skipping to next playable file." = "无法播放该文件。跳到下一个可播放文件。";
"Too much entries! Playlist will be limited to %d first entries." = "条目过多!播放列表将限制为前 %d 个条目。";
"Playlist is full. Delete some entries to add more." = "播放列表已满。删除一些条目以添加更多。";

/* Metadata */
"unknown_title" = "未知标题";
"unknown_album" = "未知专辑";
"now_playing_format" = "正在播放: %@ 来自 %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "新播放列表";
"Create new playlist" = "创建新播放列表";
"Save current one" = "保存当前列表";
"Rename playlist" = "重命名播放列表";
"Add to a playlist" = "添加到播放列表";
"Choose a playlist" = "选择播放列表";

/* Playlist Descriptions */
"Create a new empty playlist." = "创建一个新的空播放列表。";
"Create a playlist from currently played files." = "从当前播放的文件创建播放列表。";
"Browse files" = "浏览文件";
"Add or remove entries from browser." = "从浏览器添加或删除条目。";
"Choose a new name." = "选择一个新名称。";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "确定要删除此播放列表吗?";
"Are you sure you want to delete this entry ?" = "确定要删除此条目吗?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "下载";
"Download queue: 1 file" = "下载队列: 1 个文件";
"Download queue: %d files" = "下载队列: %d 个文件";
"No download in progress" = "没有正在进行的下载";
"Downloaded %@" = "已下载 %@";
"Downloading %@" = "正在下载 %@";
"Cannot download from this URL." = "无法从此 URL 下载。";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "无法添加文件。请使用文件浏览器手动查看(本地浏览/下载)。";
"File already available locally. Do you want to download it again?" = "文件已在本地可用。是否要再次下载?";
"URL have to start with ftp:// or http://" = "URL 必须以 ftp:// 或 http:// 开头";
"Cannot connect to FTP." = "无法连接到 FTP。";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "数据库已创建。";
"Database will now be recreated. Please validate & wait." = "数据库将重新创建。请确认并等待。";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "数据库版本错误: %d.%d。将更新到 %d.%d。请确认并等待。";
"No database found. Will create a new one. Please validate & wait..." = "未找到数据库。将创建一个新的。请确认并等待...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "检测到图像";
"Choose_SaveCover" = "将图像保存为 %@ 的封面?";
"CoverFolder" = "作为文件夹封面";
"CoverFile" = "作为文件封面";
"Confirm_RemCurCovers" = "删除 %@ 的当前封面(文件夹和文件)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "通用";
"Settings_Player" = "播放器";
"Settings_Display" = "显示";
"Settings_Download" = "下载";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "播放库";
"Settings_Settings" = "设置";

/* Settings Presets */
"Settings_SettingsDefault" = "默认";
"Settings_SettingsHigh" = "高";
"Settings_SettingsMed" = "中";
"Settings_SettingsLow" = "低";

"Confirm_SettingsDef" = "确定要使用'默认'值重置设置吗?";
"Confirm_SettingsHigh" = "确定要使用'高'值重置设置吗?";
"Confirm_SettingsMed" = "确定要使用'中等'值重置设置吗?";
"Confirm_SettingsLow" = "确定要使用'低'值重置设置吗?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "搜索: 简化正则表达式 ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "启动时恢复位置";
"Notification" = "通知";
"Notification duration" = "通知持续时间";
"Disable screen auto lock" = "禁用屏幕自动锁定";
"No screen auto lock" = "无屏幕自动锁定";
"Enable playback ratio" = "启用播放比率";
"Playback ratio" = "播放比率";
"Default length" = "默认长度";
"Default length %d:%.2d" = "默认长度 %d:%.2d";
"Fade-out time" = "淡出时间";
"Silence Detection" = "静音检测";
"Stop song if silent for more than selected number of seconds. 0: off" = "如果静音超过选定的秒数则停止歌曲。0: 关闭";
"Will skip song if nothing is played for specified duration (0=off)" = "如果在指定时间内没有播放内容则跳过歌曲(0=关闭)";
"Force mono" = "强制单声道";
"Panning" = "声像";
"Panning value" = "声像值";
"Audio latency" = "音频延迟";
"Audio latency in ms" = "音频延迟(毫秒)";
"Multi default action" = "多首默认操作";
"Browse" = "浏览";
"Archive/multi play mode" = "存档/多首播放模式";
"Entry"="条目";

/* Archive Settings */
"Archive multi default action" = "存档多首默认操作";
"Archive multi play mode" = "存档多首播放模式";

/* Playlist Settings */
"Play/Enqueue action" = "播放/加入队列操作";
"Enqueue mode" = "加入队列模式";
"Default Action" = "默认操作";
"Play" = "播放";
"Enqueue" = "加入队列";
"Enq.&Play" = "加入并播放";
"First" = "最前";
"Current" = "当前";
"Last" = "最后";
"Enqueue position" = "加入队列位置";
"Post download action" = "下载后操作";
"Nothing" = "无";

/* Display Settings */
"Background mode" = "后台模式";
"Partial" = "部分";
"Full" = "完整";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "关闭=无后台进程,部分=继续播放音乐,完整=在后台保持应用开启";
"Long name truncate" = "长名称截断";
"Head" = "开头";
"Mid." = "中间";
"Tail" = "末尾";
"Filename as title" = "文件名作为标题";

/* Local Files Settings */
"Auto. restore Samples folder" = "自动恢复示例文件夹";
"Send statistics" = "发送统计信息";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "数据库";
"Settings_CleanDB" = "清理数据库";
"Settings_ResetPlCnt" = "重置播放计数";
"Settings_ResetRatings" = "重置评分";
"Settings_ResetDB" = "重置整个数据库";

"Confirm_DBClean" = "启动数据库清理(可能需要一段时间)?";
"Confirm_Reset_PlCnt" = "确定要重置所有播放计数吗?";
"Confirm_Reset_Ratings" = "确定要重置所有评分吗?";
"Confirm_ResetDB" = "确定要重置整个数据库吗?播放列表、评分、计数器将被删除。";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "本地文件";
"Settings_RecreateSamples" = "重新创建'示例'文件夹";
"Settings_FormatDownloads" = "格式化'下载'文件夹";
"Settings_RemCovers" = "删除封面";
"Settings_UpdateFilesBackupFlag" = "检查文件系统";

"Confirm_RecreateSamples" = "是否要重新创建'示例'文件夹。";
"Confirm_FormatDownloads" = "是否要从本地浏览/网页文件夹中删除所有文件。";
"Confirm_CheckFiles" = "是否要执行本地文件系统检查?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "OPL 类型";
"Stereo surround" = "立体声环绕";

/* GBSPlay */
"HP filter type" = "高通滤波器类型";
"Highpass filter type" = "高通滤波器类型";

/* Game Music Emu (GME) */
"Stereo separation" = "立体声分离";
"Ignore silence" = "忽略静音";
"Silence detection" = "静音检测";
"Equalizer" = "均衡器";
"Bass" = "低音";
"Treble" = "高音";

/* GSF */
"Sound quality" = "音质";
"Interpolation" = "插值";
"Low-pass filter" = "低通滤波器";
"Echo" = "回声";

/* Highly Complete (HC) */
"Resample quality" = "重采样质量";
"Main enabled" = "主音启用";
"Reverb enabled" = "混响启用";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY 默认长度";
"LPF strength" = "低通滤波器强度";
"Min=off, default: 112" = "最小=关闭,默认: 112";
"HPF strength" = "高通滤波器强度";
"Region" = "区域";
"VRC7 Patches" = "VRC7 补丁";
"Force IRQ" = "强制 IRQ";
"Quality" = "质量";

/* OpenMPT */
"Master volume" = "主音量";
"Sampling" = "采样";
"Resampling" = "重采样";

/* SID */
"Engine" = "引擎";
"Filter" = "滤波器";
"Force loop" = "强制循环";
"Clock" = "时钟";
"Model" = "型号";
"Force 2nd SID" = "强制第二个 SID";
"Address 2nd" = "第二地址";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF 或 0xDE00-0xDFFF";
"Force 3rd SID" = "强制第三个 SID";
"Address 3rd" = "第三地址";
"Start subsong" = "开始子曲目";
"Subsong start position: first one or the one specified in file's header" = "子曲目起始位置：第一个或文件头中指定的";
"Header" = "文件头";

/* Timidity */
"Max loop" = "最大循环";
"MIDI polyphony" = "MIDI 复音";
"Amplification" = "放大";
"Chorus" = "合唱";
"Reverb" = "混响";
"Resample" = "重采样";
"LP filter" = "低通滤波器";

/* UADE */
"Headphones" = "耳机";
"LED filter" = "LED 滤波器";
"Normalization" = "标准化";
"Post FX" = "后期效果";
"Panning" = "声像";
"Panning value" = "声像值";
"Gain" = "增益";
"Gain value" = "增益值";
"Force NTSC" = "强制 NTSC";

/* VGMPlay */
"Prefer JTAG" = "首选 JTAG";
"YM2612 emulator" = "YM2612 模拟器";
"Nuked OPN2 option" = "Nuked OPN2 选项";
"YMF262 emulator" = "YMF262 模拟器";
"YM3812 emulator" = "YM3812 模拟器";
"QSound emulator" = "QSound 模拟器";
"RF5C68 emulator" = "RF5C68 模拟器";

/* VGMStream */
"Max loop" = "最大循环";

/* XMP */
"Amiga 500 Filter" = "Amiga 500 滤波器";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "特效透明度";
"FX Fullscreen" = "特效全屏";
"FX FPS" = "特效帧率";
"FX show info" = "特效显示信息";
"Tech Info" = "技术信息";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "显示 FPS 和其他信息(CPU、分辨率、ProjectM 音频数据)";
"FX Level of details" = "特效细节级别";
"Low" = "低";
"Med" = "中";
"High" = "高";
"Slow FX limit" = "慢特效限制";
"Deactivate FX if too slow." = "如果太慢则停用特效。";
"Weak" = "弱";
"Strong" = "强";
"Display song info" = "显示歌曲信息";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "在全屏时,更改时显示歌曲信息。TL 为左上角,DR 为右下角,C 为中心。";

/* ProjectM */
"ProjectM settings" = "ProjectM 设置";
"ProjectM on/off" = "ProjectM 开/关";
"Show preset label" = "显示预设标签";
"Auto switch presets mode" = "自动切换预设模式";
"Lock preset" = "锁定预设";
"Time between preset" = "预设之间的时间";
"Blend presets" = "混合预设";
"Blend time" = "混合时间";
"Bundled presets" = "内置预设";
"Custom presets" = "自定义预设";
"Aspect ratio" = "宽高比";
"Mesh size X" = "网格大小 X";
"Mesh size Y" = "网格大小 Y";
"Hard cut enabled" = "硬切启用";
"Hard cut min time" = "硬切最小时间";
"Hard cut sensitivity" = "硬切灵敏度";
"Beat sensitivity" = "节拍灵敏度";
"Permissive mode" = "宽松模式";

/* Oscilloscope */
"Oscillo settings" = "示波器设置";
"FX mode" = "特效模式";
"Show label" = "显示标签";
"Label font size" = "标签字体大小";
"Show grid" = "显示网格";
"Grid color" = "网格颜色";
"Line width" = "线宽";
"Mono color" = "单色";
"Multi color set" = "多色集";
"Reset all colors" = "重置所有颜色";
"Thin" = "细";
"Medium" = "中";
"Thick" = "粗";
"Beefy" = "特粗";

/* Piano Roll / MIDI */
"Piano roll" = "钢琴卷帘";
"Activate Piano roll FX, standard or 'Synthesia' like" = "激活钢琴卷帘特效,标准或类似'Synthesia'";
"Activate spark FX, colored or white" = "激活火花特效,彩色或白色";
"Display voices labels" = "显示声部标签";
"Display octaves labels" = "显示八度标签";
"MIDI pattern" = "MIDI 模式";
"MIDI cut line" = "MIDI 切割线";
"MIDI bar style" = "MIDI 条样式";
"MIDI bar vibrato" = "MIDI 条颤音";
"Piano 3D" = "钢琴 3D";
"Piano cut line" = "钢琴切割线";
"Piano color mode" = "钢琴颜色模式";

/* Spectrum */
"3D spectrum" = "3D 频谱";
"3D spectrum bloom" = "3D 频谱泛光";
"Spectrum" = "频谱";
"3D landscape" = "3D 景观";
"3D landscape bloom" = "3D 景观泛光";

/* MOD Pattern */
"MOD pattern" = "MOD 模式";
"MOD pattern BG alpha" = "MOD 模式背景透明度";
"MOD pattern vol bar" = "MOD 模式音量条";
"MOD pattern current line mode" = "MOD 模式当前行模式";
"MOD pattern font" = "MOD 模式字体";
"MOD pattern font size" = "MOD 模式字体大小";
"MOD pattern theme" = "MOD 模式主题";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>欢迎使用 Modizer 的网络浏览器！</b><br><br>使用上方的地址栏进行导航或浏览您的书签。<br><br>要使用图片作为封面，请通过长按（iOS）或右键单击（macOS）将其复制到剪贴板。";
"Bookmarks" = "书签";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.6 © Yohann Magnien / YoyoFR\n\n联系: mailto:modizerhelp@gmail.com\n网站: https://modizer.app\n\nModizer 的标志由 Steve Miele 设计。\n\n支持的文件格式/扩展名数量: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\n集成播放器库:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(使用 Merlin_gold SF2 音色库)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebSID\n- ZXTune\n\n免责声明:\n对 Modland、HVSC 和 ASMA 库的互联网访问以原样服务提供,不保证可用性和/或功能性。使用本应用程序的风险由您自行承担。";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "邮件支持";
"Contact support by email" = "通过电子邮件联系支持";
"[Please describe your request below]" = "[请在下方描述您的请求]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "谢谢! ❤️";
"Send a tip to Modizer" = "给 Modizer 打赏";
"Support Modizer development" = "支持 Modizer 开发";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "清理数据库并\n重置设置";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "首次启动或上次运行 Modizer 时遇到问题。应用默认设置?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* 意图标题 */
"Play" = "播放";
"Pause" = "暂停";
"Stop" = "停止";
"Next Song" = "下一首";
"Previous Song" = "上一首";
"Play Subsong" = "播放子歌曲";
"Seek" = "定位";
"Set Infinite Loop" = "设置无限循环";
"Set Loop Mode" = "设置循环模式";
"Set Shuffle Mode" = "设置随机模式";
"Toggle Shuffle" = "切换随机";
"Toggle Loop Mode" = "切换循环模式";
"Set Fullscreen mode" = "设置全屏模式";
"Go the player view" = "转到播放器视图";
"Set FX" = "设置FX";
"Get Now Playing" = "获取正在播放";
"Get Playlists" = "获取播放列表";
"Play some music" = "播放音乐";
"Play most played" = "播放最常播放";
"Play favorites" = "播放收藏";
"Play Playlist" = "播放播放列表";
"Play Playlist By Name" = "按名称播放播放列表";

/* 意图描述 */
"Starts playing music in Modizer." = "在Modizer中开始播放音乐。";
"Pauses music playback in Modizer." = "在Modizer中暂停音乐播放。";
"Stops music playback in Modizer." = "在Modizer中停止音乐播放。";
"Skips to the next song in Modizer." = "在Modizer中跳到下一首歌曲。";
"Skips to the previous song in Modizer." = "在Modizer中跳到上一首歌曲。";
"Plays a specific subsong in the current file." = "播放当前文件中的特定子歌曲。";
"Seeks to a specific position in the current song." = "定位到当前歌曲中的特定位置。";
"Set the infinite loop mode in Modizer." = "在Modizer中设置无限循环模式。";
"Set the loop mode in Modizer." = "在Modizer中设置循环模式。";
"Set the shuffle mode in Modizer." = "在Modizer中设置随机模式。";
"Toggles shuffle mode in Modizer." = "在Modizer中切换随机模式。";
"Toggles loop mode in Modizer." = "在Modizer中切换循环模式。";
"Set Fullscreen mode on or off in Modizer." = "在Modizer中打开或关闭全屏模式。";
"Go the player view in Modizer." = "在Modizer中转到播放器视图。";
"Set FX mode in Modizer." = "在Modizer中设置FX模式。";
"Gets information about the currently playing song." = "获取当前正在播放的歌曲信息。";
"Gets the list of available playlists in Modizer." = "获取Modizer中可用的播放列表。";
"Random picks from available local titles in Modizer." = "从Modizer中可用的本地曲目中随机选择。";
"Most played titles from available local titles in Modizer." = "从Modizer中可用的本地曲目中选择最常播放的曲目。";
"Favorites titles from available local titles in Modizer." = "从Modizer中可用的本地曲目中选择收藏的曲目。";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "在Modizer中播放特定播放列表。注意：为获得语音命令的最佳效果，请使用'按名称播放播放列表'。";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "在Modizer中按名称播放播放列表。推荐用于语音命令。";

/* 参数 */
"Subsong Index" = "子歌曲索引";
"The index of the subsong to play" = "要播放的子歌曲的索引";
"Position (seconds)" = "位置（秒）";
"The position to seek to in seconds" = "要定位到的位置（秒）";
"Relative" = "相对";
"Whether to seek relative to current position" = "是否相对于当前位置定位";
"Infinite Loop Mode" = "无限循环模式";
"0: off, 1: infinite loop" = "0: 关闭，1: 无限循环";
"Repeat Mode" = "重复模式";
"0: off, 1: loop current title, 2: loop playlist" = "0: 关闭，1: 循环当前曲目，2: 循环播放列表";
"Shuffle Mode" = "随机模式";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: 关闭，1: 如果文件有子歌曲或是存档则只选择一首，2: 播放给定文件的所有曲目";
"Fullscreen mode" = "全屏模式";
"Activate (1) or disactivate (0) Fullscreen mode" = "激活（1）或停用（0）全屏模式";
"FX" = "FX";
"The FX to set" = "要设置的FX";
"FX Mode" = "FX模式";
"The mode to activate for the selected FX (0:off)" = "要为所选FX激活的模式（0:关闭）";
"Playlist" = "播放列表";
"The playlist to play" = "要播放的播放列表";
"Start Index" = "起始索引";
"The index of the song to start playing from (0-based)" = "开始播放的歌曲索引（从0开始）";
"Playlist Name" = "播放列表名称";
"The name of the playlist to play" = "要播放的播放列表的名称";
"Which playlist would you like to play?" = "您想播放哪个播放列表？";

/* 对话消息 */
"play_playlist_dialog" = "正在播放播放列表 %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "未找到播放列表。使用'获取播放列表'查看可用的播放列表。";
"No playlists found" = "未找到播放列表";

/* FX名称 */
"ProjectM" = "ProjectM";
"Oscillo" = "示波器";
"Piano roll" = "钢琴卷帘";
"3D Piano" = "3D钢琴";
"Notes bars" = "音符条";
"Tracker" = "跟踪器";
"2D Spectrum" = "2D频谱";
"3D Spectrum" = "3D频谱";
"3D Landscape" = "3D景观";

// ================================

"Get Now Playing" = "获取正在播放";
"Which playlist would you like to play?" = "您想播放哪个播放列表?";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "语音命令";
"Siri voice commands for Modizer" = "Modizer 的 Siri 语音命令";
"Voice Commands: Playback" = "播放";
"Voice Commands: Navigation" = "导航";
"Voice Commands: Playlists" = "播放列表";
"Voice Commands: Modes" = "模式";
// MARK: - TABS
// ================================

"Search" = "搜索";
"More" = "更多";
"Suspend" = "暂停";
"Clear all" = "全部清除";
"Online" = "在线";
"Local" = "本地";
"Add Folder" = "添加文件夹";
"Remove" = "移除";
"Select Folder" = "选择文件夹";
"Choose a folder to browse in Modizer. Files are not copied." = "选择要在 Modizer 中浏览的文件夹。不会复制或删除其中的文件。";
"Cannot access this folder. You can remove it from the list." = "无法访问该文件夹。你可以从列表中移除它。";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "关于";
"Some general informations" = "一些一般信息";
"Settings" = "设置";
"Global, Visu, FTP & Plugins" = "全局、可视化、FTP 和插件";
"Maintenance" = "维护";
"Clean DB, Reset ratings, ..." = "清理数据库、重置评分...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "收藏";
"Browse Internet" = "浏览互联网";
"Games Music" = "游戏音乐";
"Mods & chiptunes" = "Mod 和芯片音乐";
"Other" = "其他";

/* Collections */
"MODLAND collection" = "MODLAND 收藏";
"AMP collection" = "AMP 收藏";
"HVSC collection" = "HVSC 收藏";
"ASMA collection" = "ASMA 收藏";
"JOSHW collection" = "JOSHW 收藏";
"VGMRips collection" = "VGMRips 收藏";
"SNESmusic collection" = "SNESmusic 收藏";
"SMS Power! collection" = "SMS Power! 收藏";
"ZXArt collection" = "ZXArt 收藏";

/* Collection Descriptions */
"%d entries" = "%d 个条目";
"Thousands of entries" = "数千个条目";
"4K+ packs / 70K+ songs" = "4K+ 包 / 70K+ 歌曲";
"1500+ sets / Super Nintendo/Famicom" = "1500+ 套 / 超级任天堂/Famicom";
"Master System & Game gear sets" = "Master System 和 Game Gear 套装";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizer 世界排行榜";
"Web browser" = "网页浏览器";
"No internet connectivity or website down." = "没有互联网连接或网站关闭。";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "全局";
"Default Players" = "默认播放器";
"Visualizers" = "可视化";
"PR & NS colors settings" = "钢琴卷帘和音符滚动颜色设置";
"Plugins" = "插件";

/* Player Selection */
"MOD player" = "MOD 播放器";
"SAP player" = "SAP 播放器";
"SID player" = "SID 播放器";
"VGM player" = "VGM 播放器";
"YM player" = "YM 播放器";
"NSF player" = "NSF 播放器";
"PT3 player" = "PT3 播放器";
"GBS player" = "GBS 播放器";
"KSS player" = "KSS 播放器";
"2SF player" = "2SF 播放器";
"MIDI player" = "MIDI 播放器";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "仅适用于支持此功能的插件(GME、NSFPLAY、LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=自动,延迟四舍五入为音频缓冲区大小的倍数";
"Limited: not for subsong" = "限制: 不适用于子曲目";
"Default value is 3s" = "默认值为 3 秒";
"Default action when selecting an archive or a multisong file" = "选择存档或多首歌曲文件时的默认操作";
"Play only selected entry or full archive/multisong file" = "仅播放选定条目或完整存档/多首歌曲文件";
"Show Welcome screen" = "显示欢迎屏幕";
"Adplug priority for module" = "Adplug 模块优先级";

/* FTP Settings */
"Server status" = "服务器状态";
"FTP Server" = "FTP 服务器";
"Authorize anonymous" = "允许匿名";
"User" = "用户";
"Password" = "密码";
"Port" = "端口";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLAND 服务器";
"MODLAND cust.URL" = "MODLAND 自定义 URL";
"HVSC Server" = "HVSC 服务器";
"HVSC cust.URL" = "HVSC 自定义 URL";
"ASMA Server" = "ASMA 服务器";
"ASMA cust.URL" = "ASMA 自定义 URL";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "模式背景透明度";
"Opacity of mod patterns view" = "MOD 模式视图的不透明度";
"MOD Color Theme" = "MOD 颜色主题";
"MOD Current Line" = "MOD 当前行";
"MOD Volume bars" = "MOD 音量条";
"MOD Pattern Font" = "MOD 模式字体";
"MOD Pattern Font Size" = "MOD 模式字体大小";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "钢琴卷帘特效";
"PR/Spark FX" = "钢琴卷帘/火花特效";
"Display voices label" = "显示声部标签";
"Notes scroller FX" = "音符滚动特效";
"NS/bars mode" = "音符滚动/条模式";
"NS/bars style" = "音符滚动/条样式";
"Vibrato display" = "颤音显示";
"Piano FX" = "钢琴特效";
"Piano bars mode" = "钢琴条模式";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D 频谱泛光";
"3D Land. Bloom" = "3D 景观泛光";
"0: off" = "0: 关闭";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM 特效";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "渲染质量: 最大为像素分辨率,1/2 为一半...";
"Custom presets/textures should be copied in .projectm folder" = "自定义预设/纹理应复制到 .projectm 文件夹";
"Display preset name" = "显示预设名称";
"Lim: display and disappear quickly" = "限制: 快速显示并消失";
"Auto switch presets" = "自动切换预设";
"Allow loading of milk file with script issues" = "允许加载有脚本问题的 milk 文件";
"Default is 15s" = "默认为 15 秒";
"Default is 2.7s" = "默认为 2.7 秒";
"Default value is 32" = "默认值为 32";
"Default value is 24" = "默认值为 24";
"Default value is 20" = "默认值为 20";
"Hardcut" = "硬切";
"Hardcut triggers presets switch synchronized with beats." = "硬切触发与节拍同步的预设切换。";
"Hardcut min time" = "硬切最小时间";
"Preserve aspect ratio for compatible shaders." = "为兼容的着色器保留宽高比。";
"Default value is 1" = "默认值为 1";
"Hardcut sensitivity" = "硬切灵敏度";

/* Oscilloscope Settings */
"Oscillo FX" = "示波器特效";
"Oscillo show labels" = "示波器显示标签";
"Oscillo labels font size" = "示波器标签字体大小";
"Oscillo show grid" = "示波器显示网格";
"Oscillo line width" = "示波器线宽";
"Reset all custom colors" = "重置所有自定义颜色";
"Multi color | System 1" = "多色 | 系统 1";
"Multi color | System 2" = "多色 | 系统 2";
"Multi color | System 3" = "多色 | 系统 3";
"Multi color | System 4" = "多色 | 系统 4";
"Multi color | System 5" = "多色 | 系统 5";
"Multi color | System 6" = "多色 | 系统 6";
"Multi color | System 7" = "多色 | 系统 7";
"Multi color | System 8" = "多色 | 系统 8";

/* Piano/MIDI Colors */
"Custom color 01" = "自定义颜色 01";
"Custom color 02" = "自定义颜色 02";
"Custom color 03" = "自定义颜色 03";
"Custom color 04" = "自定义颜色 04";
"Custom color 05" = "自定义颜色 05";
"Custom color 06" = "自定义颜色 06";
"Custom color 07" = "自定义颜色 07";
"Custom color 08" = "自定义颜色 08";
"Custom color 09" = "自定义颜色 09";
"Custom color 10" = "自定义颜色 10";
"Custom color 11" = "自定义颜色 11";
"Custom color 12" = "自定义颜色 12";
"Custom color 13" = "自定义颜色 13";
"Custom color 14" = "自定义颜色 14";
"Custom color 15" = "自定义颜色 15";
"Custom color 16" = "自定义颜色 16";
"Custom color 17" = "自定义颜色 17";
"Custom color 18" = "自定义颜色 18";
"Custom color 19" = "自定义颜色 19";
"Custom color 20" = "自定义颜色 20";
"Custom color 21" = "自定义颜色 21";
"Custom color 22" = "自定义颜色 22";
"Custom color 23" = "自定义颜色 23";
"Custom color 24" = "自定义颜色 24";
"Custom color 25" = "自定义颜色 25";
"Custom color 26" = "自定义颜色 26";
"Custom color 27" = "自定义颜色 27";
"Custom color 28" = "自定义颜色 28";
"Custom color 29" = "自定义颜色 29";
"Custom color 30" = "自定义颜色 30";
"Custom color 31" = "自定义颜色 31";
"Custom color 32" = "自定义颜色 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "如果在指定时间内没有播放内容则跳过歌曲(0=关闭)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "默认长度";
"Oversampling. Min=0, default: 10" = "过采样。最小=0,默认: 10";
"Min=off, default: 112" = "最小=关闭,默认: 112";
"Max=off, default: 164" = "最大=关闭,默认: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=强制 NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "强制所有 NSF 的 IRQ 功能,不仅仅是 NSF2";
"APU unmute on reset" = "重置时 APU 取消静音";
"APU phase reset" = "APU 相位重置";
"APU non linear mixing" = "APU 非线性混音";
"APU swap duty 1/2" = "APU 交换占空比 1/2";
"APU Initialize sweep unmute" = "APU 初始化扫描取消静音";
"DMC enable $4011 writes" = "DMC 启用 $4011 写入";
"DMC enable periodic noise" = "DMC 启用周期性噪声";
"DMC unmute on reset" = "重置时 DMC 取消静音";
"DMC anti clicking" = "DMC 防爆音";
"DMC non linear mixer" = "DMC 非线性混音器";
"DMC randomize noise on reset" = "重置时 DMC 随机化噪声";
"DMC mute triangle on pitch 0" = "DMC 在音高 0 时静音三角波";
"prevents high frequency aliasing" = "防止高频混叠";
"DMC rand. triangle" = "DMC 随机三角波";
"randomize triangle on reset" = "重置时随机化三角波";
"DMC reverse bits" = "DMC 反转位";
"reverse bits of DPCM sample bytes" = "反转 DPCM 采样字节的位";
"MMC5 non linear mixing" = "MMC5 非线性混音";
"MMC5 Phase reset" = "MMC5 相位重置";
"Reset phase counter after write $5003 and $5007" = "写入 $5003 和 $5007 后重置相位计数器";
"FDS LP filter in Hz" = "FDS 低通滤波器(Hz)";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "截止频率(0Hz=关闭,2000Hz=默认)";
"FDS reset \"phase\"" = "FDS 重置'相位'";
"$4085 \"resets\" modular phase" = "$4085 '重置'调制相位";
"FDS write protect" = "FDS 写保护";
"write protect $8000-DFFF" = "写保护 $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 替换为 OPLL";
"N163 Serial Multiplex mixing" = "N163 串行多路混音";
"N163 Write Protect Phase" = "N163 写保护相位";
"N163 Limit Wavelength" = "N163 限制波长";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "仅适用于 HC 插件";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "数字增强";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "声像值";
"Gain value" = "增益值";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "禁用";
"Enter playlist name" = "输入播放列表名称";
"Ask" = "询问";
"Play All" = "播放全部";
"Single" = "单个";
"Archive" = "存档";
"On" = "开启";
"Off" = "关闭";
"Lim" = "限制";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "添加播放列表";
"Create a new playlist" = "创建新播放列表";
"Now playing" = "正在播放";
"1 entry" = "1 个条目";
"No entry" = "无条目";
"Random picks" = "随机选择";
"Generate a randomized playlist" = "生成随机播放列表";
"Most played" = "最常播放";
"Favorites" = "收藏夹";

/* Playlist Actions */
"Add/Remove files..." = "添加/删除文件...";
"More actions..." = "更多操作...";
"Save as a new playlist" = "另存为新播放列表";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "欢迎使用 Modizer!\n";
"Level up your library." = "升级您的音乐库。";
"Sound meets visuals." = "声音与视觉的完美融合。";
"Made with passion,\noffered for free." = "用心制作,\n免费提供。";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "您的复古和追踪器音乐门户。\n用传奇游戏音乐、标志性追踪器模块和永恒的芯片音乐经典为您的设备充电。";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "浏览和流式传输在线目录,完善您的收藏。\n轻松构建、编辑和收听播放列表。";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "解锁经典示波器外观、频谱条、钢琴卷帘、追踪器视图和 ProjectM/Milkdrop 特效。让 Modizer 用动作和色彩为每个轨道上色。";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "如果您喜欢这个应用程序,打赏是支持其持续开发的好方法。\n感谢您帮助 Modizer 保持活力和发展。";

"Skip" = "跳过";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "打赏支持";
"Enjoy Modizer ?" = "喜欢 Modizer ?";
"Your support helps keep Modizer running and ad-free!" = "您的支持帮助 Modizer 保持运行和无广告!";
"Already tipped so far" = "至今已打赏";
"Thank you for your support! ❤️" = "感谢您的支持! ❤️";

/* Tip Tiers */
"Coffee" = "咖啡";
"Coffee & Croissant" = "咖啡和羊角面包";
"Dinner" = "晚餐";
"Loading..." = "加载中...";

/* Tip Actions */
"Confirm Tip" = "确认打赏";
"Send Tip" = "发送打赏";
"Send a %@ tip for %@?" = "为 %@ 发送 %@ 打赏?";
"Tip" = "打赏";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "无法加载产品。请检查您的互联网连接。";

/* Thank You Alert */
"Thank You! ❤️" = "谢谢! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "您的支持意义重大!感谢您帮助 Modizer 保持运行。";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "清理数据库";
"Clear 'Now Playing' queue" = "清空'正在播放'队列";
"Recreate Samples folder" = "重新创建示例文件夹";
"Reset settings to default" = "重置设置为默认值";
"Remove current cover" = "删除当前封面";
"Reset Ratings" = "重置评分";
"Reset Played Counters" = "重置播放计数";
"Reset Database" = "重置数据库";
"Clear images cache" = "清除图像缓存";

/* Playlists missing files download */
"Download missing playlists files" = "下载播放列表中缺失的文件";
"Queue the download of the missing files coming from online collections ?" = "将来自在线合集的缺失文件加入下载队列？";
"Download missing files" = "下载缺失的文件";
"%d missing file(s)" = "缺失 %d 个文件";
"%d missing file(s), %d can be downloaded. Tap to download." = "缺失 %d 个文件，其中 %d 个可下载。点按即可下载。";
"Supported collections:" = "支持的合集：";
"Check" = "检查";
"Checking playlists" = "正在检查播放列表";
"Download manager is not available." = "下载管理器不可用。";
"%d file(s) queued for download." = "已将 %d 个文件加入下载队列。";
"%d file(s) already available." = "%d 个文件已存在。";
"%d file(s) not from an online collection." = "%d 个文件不属于在线合集。";
"%d file(s) cannot be resolved (%@), browse the collection to download them." = "%d 个文件无法定位 (%@)，请浏览合集以下载它们。";

/* Maintenance Messages */
"Settings reseted" = "设置已重置";
"Ratings reseted" = "评分已重置";
"Played Counters reseted" = "播放计数已重置";
"Samples folder created" = "示例文件夹已创建";
"Cache cleaned" = "缓存已清理";
"Database reseted" = "数据库已重置";
"No cover to remove" = "没有可删除的封面";
"Cover removed" = "封面已删除";
"Database cleaned" = "数据库已清理";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "确定要清理数据库吗?这可能需要一段时间?";
"Clean" = "清理";
"Cleaning DB" = "清理数据库";
"Cancelling..." = "取消中...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "关闭特效\n窗口";
"All FX off" = "关闭所有特效";
"FX\nalpha" = "特效\n透明度";
"Show name\ntemp." = "临时显示\n名称";
"Show name" = "显示名称";
"Bundled\npresets" = "内置\n预设";
"Custom\npresets" = "自定义\n预设";
"Blend\npresets" = "混合\n预设";
"Clear\nall" = "清空\n全部";
"Select\nall" = "选择\n全部";
"Favorites" = "收藏夹";
"Expand" = "展开";
"Select\nlisted" = "选择\n列出项";
"Remove\nlisted" = "删除\n列出项";
"Selected" = "已选择";
"Collapse" = "折叠";
"Labels" = "标签";
"Grid" = "网格";
"Voices\nlabels" = "声部\n标签";
"Octaves\nlabels" = "八度\n标签";
"Volume\nbars" = "音量\n条";
"Fixed bar" = "固定条";
"BG\nopacity" = "背景\n不透明度";
"Bloom:\n%s" = "泛光:\n%s";
"Thickness:\n%s" = "粗细:\n%s";
"Font size\n%s" = "字体大小\n%s";
"Font:\n%s" = "字体:\n%s";
"Info HUD:\n%s" = "信息 HUD:\n%s";
"Select active %s presets" = "选择活动的 %s 预设";
"bundled" = "内置";
"custom" = "自定义";
"Select\ncustom\npresets" = "选择\n自定义\n预设";
"Select\nbundled\npresets" = "选择\n内置\n预设";
"Themes:\n%s" = "主题:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "在Modizer中播放音乐";
"Start random playlist in Modizer" = "在Modizer中随机播放";
"Play favorites in Modizer" = "在Modizer中播放收藏";
"Start favorites playlist in Modizer" = "播放Modizer的收藏列表";
"Play most played in Modizer" = "在Modizer中播放最常播放";
"Start most played playlist in Modizer" = "播放Modizer的热门歌曲";
"Play a playlist in Modizer" = "在Modizer中播放播放列表";
"Start a playlist in Modizer" = "播放Modizer的播放列表";
"Toggle shuffle mode in Modizer" = "在Modizer中切换随机模式";
"Change shuffle mode in Modizer" = "更改Modizer的随机播放";
"Change loop mode in Modizer" = "在Modizer中更改循环模式";
"Toggle repeat in Modizer" = "切换Modizer的重复播放";
"What's playing in Modizer" = "Modizer正在播放什么";
"Current song in Modizer" = "Modizer的当前歌曲";

"Voices commands aren't supported in MacOS." = "macOS 不支持语音命令。";

/* Error messages */
  "playlist_not_found_error" = "找不到播放列表。使用'获取播放列表'查看可用播放列表。";
  "playlist_empty_error" = "此播放列表没有条目。请先添加音乐。";

"%@ (name)" = "%@（名称）";
  "%@ (packs)" = "%@（包）";
  "%@ (rating)" = "%@（评分）";
  "2D Spectrum settings" = "2D频谱设置";
  "3D landscape settings" = "3D景观设置";
  "3D spectrum settings" = "3D频谱设置";
  "Auto\nscaling" = "自动\n缩放";
  "CGSC collection" = "CGSC收藏";
  "CoverLibraryFolder" = "作为当前库文件夹封面";
  "Feeling lucky" = "手气不错";
  "Hide MIDI & Piano FX" = "隐藏MIDI和钢琴特效";
  "Hide other note based FX if displayed (Piano, Midi)" = "如果显示，隐藏其他基于音符的特效（钢琴，Midi）";
  "JoshW Covers" = "JoshW封面";
  "Limit applied in Radio mode to avoid downloading too big files." = "在电台模式下应用限制以避免下载过大的文件。";
  "MIDI pattern settings" = "MIDI模式设置";
  "MOD Pattern settings" = "MOD模式设置";
  "Next: %@" = "下一首：%@";
  "Next: loading..." = "下一首：加载中...";
  "Piano 3D settings" = "3D钢琴设置";
  "Piano roll settings" = "钢琴卷帘设置";
  "Radio download limit" = "电台下载限制";
  "Radio mode" = "电台模式";
  "Try to download covers from TGDB or MobyGames." = "尝试从TGDB或MobyGames下载封面。";

/* Cloud */
  "Add Cloud Source" = "添加云源";
  "Browse iCloud, Dropbox, ..." = "浏览 iCloud、Dropbox、...";
  "Name this source" = "命名此源";
  "Enter a name for this cloud folder" = "输入此云文件夹的名称";
  "Cloud Folder" = "云文件夹";
  "Add" = "添加";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." =
  "此云文件夹已添加，但在关闭应用后可能不会保留。某些云服务提供商不支持持久访问。";
  "File cannot be downloaded.\nPlease check your internet connection." = "文件无法下载。\n请检查您的网络连接。";
  "Downloading from\ncloud..." = "正在从\n云端下载...";
  "Download timed out. Please try again later." = "下载超时。请稍后重试。";
  "available" = "可用";

"Copy" = "复制";
"Database couldn't be updated." = "数据库无法更新。";
"Database updated." = "数据库已更新。";
"Issue %d while copying: %@.\n%@" = "复制时出错 %d: %@.\n%@";
"Old database version: %d.%d. Will update to %d.%d. Please validate & wait." = "旧数据库版本：%d.%d。将更新到 %d.%d。请确认并等待。";
"Use STIL data" = "使用STIL数据";
"Used for subsongs titles and related artists names." = "用于子曲目标题和相关艺术家名称。";

